public/blog/windows-server-setup-ssh-server/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Windows Server Setup Ssh Server</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <h1>Windows Server Setup Ssh Server</h1>

  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Sources</a>
</li>
<li><a href="#headline-2">Installing the Server</a>
</li>
<li><a href="#headline-3">Enforcing PubKey Authentication</a>
</li>
<li><a href="#headline-4">Changing the Default SSH Shell</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Sources
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ol>
<li><a href="https://docs.microsoft.com/en-us/windows/terminal/tutorials/ssh">https://docs.microsoft.com/en-us/windows/terminal/tutorials/ssh</a></li>
<li><a href="https://superuser.com/questions/1501402/how-to-change-ssh-port-on-windows-10">https://superuser.com/questions/1501402/how-to-change-ssh-port-on-windows-10</a></li>
<li><a href="https://www.concurrency.com/blog/may-2019/key-based-authentication-for-openssh-on-windows">https://www.concurrency.com/blog/may-2019/key-based-authentication-for-openssh-on-windows</a></li>
</ol>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Installing the Server
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>This will install the SSH server, start the service, and then whitelist the SSH port.
Starting the service will automatically create all the SSH files in %ProgramData%/ssh.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>Add-WindowsCapability -Online -Name OpenSSH.Server~~~~0.0.1.0
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span># Start the sshd service
</span></span><span style="display:flex;"><span>Start-Service sshd
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span># OPTIONAL but recommended:
</span></span><span style="display:flex;"><span>Set-Service -Name sshd -StartupType &#39;Automatic&#39;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span># Confirm the Firewall rule is configured. It should be created automatically by setup. Run the following to verify
</span></span><span style="display:flex;"><span>if (!(Get-NetFirewallRule -Name &#34;OpenSSH-Server-In-TCP&#34; -ErrorAction SilentlyContinue | Select-Object Name, Enabled)) {
</span></span><span style="display:flex;"><span>    Write-Output &#34;Firewall Rule &#39;OpenSSH-Server-In-TCP&#39; does not exist, creating it...&#34;
</span></span><span style="display:flex;"><span>    New-NetFirewallRule -Name &#39;OpenSSH-Server-In-TCP&#39; -DisplayName &#39;OpenSSH Server (sshd)&#39; -Enabled True -Direction Inbound -Protocol TCP -Action Allow -LocalPort 22
</span></span><span style="display:flex;"><span>} else {
</span></span><span style="display:flex;"><span>    Write-Output &#34;Firewall rule &#39;OpenSSH-Server-In-TCP&#39; has been created and exists.&#34;
</span></span><span style="display:flex;"><span>}</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Enforcing PubKey Authentication
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>If you&#39;re remoting into a non-administrative user, you can place yourpub keys in %userprofile%/.ssh/authorize_keys.</p>
<p>
Users that are a part of the &#34;Administrators&#34; group need their public keys in this file:</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>%ProgramData%\ssh\administrators_authorized_keys</span></span></code></pre></div>
</div>
<p>
The &#34;administrators_authorized_keys&#34; file must only have read/write privledges for the Administrators Group and SYSTEM user.
You can set those settings by using this Powershell snippet from the concurrency blog</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>$acl = Get-Acl C:\ProgramData\ssh\administrators_authorized_keys
</span></span><span style="display:flex;"><span>$acl.SetAccessRuleProtection($true, $false)
</span></span><span style="display:flex;"><span>$administratorsRule = New-Object system.security.accesscontrol.filesystemaccessrule(&#34;Administrators&#34;,&#34;FullControl&#34;,&#34;Allow&#34;)
</span></span><span style="display:flex;"><span>$systemRule = New-Object system.security.accesscontrol.filesystemaccessrule(&#34;SYSTEM&#34;,&#34;FullControl&#34;,&#34;Allow&#34;)
</span></span><span style="display:flex;"><span>$acl.SetAccessRule($administratorsRule)
</span></span><span style="display:flex;"><span>$acl.SetAccessRule($systemRule)
</span></span><span style="display:flex;"><span>$acl | Set-Acl</span></span></code></pre></div>
</div>
<p>
After this, you can edit the %ProgramData%/ssh/sshd_config file to change the default ssh port, disallow password authentication, etc.
If you change the default SSH port, be sure to whitelist the port in the firewall.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span># Remove the previous firwall rule for port 22 before creating this one
</span></span><span style="display:flex;"><span>New-NetFirewallRule -Name &#39;OpenSSH-Server-In-TCP&#39; -DisplayName &#39;OpenSSH Server (sshd)&#39; -Enabled True -Direction Inbound -Protocol TCP -Action Allow -LocalPort 2222</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Changing the Default SSH Shell
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>Create this registry key with the path of the shell you want to use.
You can set it to third party shells like Cygwin.bat, git bash, etc.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span># Default to Powershell
</span></span><span style="display:flex;"><span>New-ItemProperty -Path &#34;HKLM:\SOFTWARE\OpenSSH&#34; -Name DefaultShell -Value &#34;C:\Windows\System32\WindowsPowerShell\v1.0\powershell.exe&#34; -PropertyType String -Force
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span># Default to Git Bash
</span></span><span style="display:flex;"><span>New-ItemProperty -Path &#34;HKLM:\SOFTWARE\OpenSSH&#34; -Name DefaultShell -Value &#34;C:\Program Files\Git\bin\bash.exe&#34; -PropertyType String -Force
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span># Default to Cygwin
</span></span><span style="display:flex;"><span>New-ItemProperty -Path &#34;HKLM:\SOFTWARE\OpenSSH&#34; -Name DefaultShell -Value &#34;C:\cygwin64\Cygwin.bat&#34; -PropertyType String -Force</span></span></code></pre></div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
